// ===============================
// LFBN-BD 2026 Location System
// Part 1 - Divisions
// ===============================

const locationData = {"চট্টগ্রাম": {
  "চট্টগ্রাম": [
  "আনোয়ারা",
  "বাঁশখালী",
  "বোয়ালখালী",
  "কর্ণফুলী",
  "চন্দনাইশ",
  "ফটিকছড়ি",
  "হাটহাজারী",
  "লোহাগাড়া",
  "মিরসরাই",
  "পটিয়া",
  "রাঙ্গুনিয়া",
  "রাউজান",
  "সন্দ্বীপ",
  "সাতকানিয়া",
  "সীতাকুণ্ড"
],
  "কক্সবাজার": [
  "কক্সবাজার সদর",
  "চকরিয়া",
  "কুতুবদিয়া",
  "মহেশখালী",
  "পেকুয়া",
  "রামু",
  "টেকনাফ",
  "উখিয়া",
  "ঈদগাঁও"
],
  "কুমিল্লা": [
  "আদর্শ সদর",
  "বরুড়া",
  "ব্রাহ্মণপাড়া",
  "বুড়িচং",
  "চান্দিনা",
  "চৌদ্দগ্রাম",
  "দাউদকান্দি",
  "দেবিদ্বার",
  "হোমনা",
  "লাকসাম",
  "লালমাই",
  "মেঘনা",
  "মনোহরগঞ্জ",
  "মুরাদনগর",
  "নাঙ্গলকোট",
  "তিতাস"
],
  "ফেনী": [
  "ফেনী সদর",
  "ছাগলনাইয়া",
  "দাগনভূঞা",
  "পরশুরাম",
  "ফুলগাজী",
  "সোনাগাজী"
],
  "নোয়াখালী": [
  "নোয়াখালী সদর",
  "বেগমগঞ্জ",
  "চাটখিল",
  "কোম্পানীগঞ্জ",
  "হাতিয়া",
  "কবিরহাট",
  "সেনবাগ",
  "সুবর্ণচর"
],
  "লক্ষ্মীপুর": [
  "লক্ষ্মীপুর সদর",
  "রামগঞ্জ",
  "রামগতি",
  "রায়পুর",
  "কমলনগর"
],
  "ব্রাহ্মণবাড়িয়া": [
  "ব্রাহ্মণবাড়িয়া সদর",
  "আখাউড়া",
  "আশুগঞ্জ",
  "বাঞ্ছারামপুর",
  "বিজয়নগর",
  "কসবা",
  "নবীনগর",
  "নাসিরনগর",
  "সরাইল"
],
  "চাঁদপুর": [
  "চাঁদপুর সদর",
  "ফরিদগঞ্জ",
  "হাইমচর",
  "হাজীগঞ্জ",
  "কচুয়া",
  "মতলব দক্ষিণ",
  "মতলব উত্তর",
  "শাহরাস্তি"
],
  "খাগড়াছড়ি": [
  "খাগড়াছড়ি সদর",
  "দিঘীনালা",
  "গুইমারা",
  "লক্ষ্মীছড়ি",
  "মহালছড়ি",
  "মানিকছড়ি",
  "মাটিরাঙ্গা",
  "পানছড়ি",
  "রামগড়"
],
  "রাঙ্গামাটি": [
  "রাঙ্গামাটি সদর",
  "বাঘাইছড়ি",
  "বরকল",
  "বিলাইছড়ি",
  "জুরাছড়ি",
  "কাপ্তাই",
  "কাউখালী",
  "লংগদু",
  "নানিয়ারচর",
  "রাজস্থলী"
],
  "বান্দরবান": [
  "বান্দরবান সদর",
  "আলীকদম",
  "লামা",
  "নাইক্ষ্যংছড়ি",
  "রুমা",
  "রোয়াংছড়ি",
  "থানচি"
],
},

"ঢাকা": {
  "ঢাকা": [
  "ঢাকা দক্ষিণ সিটি",
  "ঢাকা উত্তর সিটি",
  "ধামরাই",
  "দোহার",
  "কেরানীগঞ্জ",
  "নবাবগঞ্জ",
  "সাভার"
],
  "গাজীপুর": [
  "গাজীপুর সদর",
  "কালীগঞ্জ",
  "কালিয়াকৈর",
  "কাপাসিয়া",
  "শ্রীপুর"
],
  "নারায়ণগঞ্জ": [
  "নারায়ণগঞ্জ সদর",
  "আড়াইহাজার",
  "বন্দর",
  "রূপগঞ্জ",
  "সোনারগাঁ"
],
  "নরসিংদী": [
  "নরসিংদী সদর",
  "বেলাবো",
  "মনোহরদী",
  "পলাশ",
  "রায়পুরা",
  "শিবপুর"
],
  "মানিকগঞ্জ": [
  "মানিকগঞ্জ সদর",
  "দৌলতপুর",
  "ঘিওর",
  "হরিরামপুর",
  "সাটুরিয়া",
  "শিবালয়",
  "সিঙ্গাইর"
],
  "মুন্সীগঞ্জ": [
  "মুন্সীগঞ্জ সদর",
  "গজারিয়া",
  "লৌহজং",
  "শ্রীনগর",
  "সিরাজদিখান",
  "টঙ্গীবাড়ী"
],
  "রাজবাড়ী": [
  "রাজবাড়ী সদর",
  "বালিয়াকান্দি",
  "গোয়ালন্দ",
  "কালুখালী",
  "পাংশা"
],
  "ফরিদপুর": [
  "ফরিদপুর সদর",
  "আলফাডাঙ্গা",
  "ভাঙ্গা",
  "বোয়ালমারী",
  "চরভদ্রাসন",
  "মধুখালী",
  "নগরকান্দা",
  "সদরপুর",
  "সালথা"
],
  "গোপালগঞ্জ": [
  "গোপালগঞ্জ সদর",
  "কাশিয়ানী",
  "কোটালীপাড়া",
  "মুকসুদপুর",
  "টুঙ্গিপাড়া"
],
  "শরীয়তপুর": [
  "শরীয়তপুর সদর",
  "ভেদরগঞ্জ",
  "ডামুড্যা",
  "গোসাইরহাট",
  "নড়িয়া",
  "জাজিরা"
],
  "মাদারীপুর": [
  "মাদারীপুর সদর",
  "কালকিনি",
  "রাজৈর",
  "শিবচর"
],
  "কিশোরগঞ্জ": [
  "কিশোরগঞ্জ সদর",
  "অষ্টগ্রাম",
  "বাজিতপুর",
  "ভৈরব",
  "হোসেনপুর",
  "ইটনা",
  "করিমগঞ্জ",
  "কটিয়াদী",
  "কুলিয়ারচর",
  "মিঠামইন",
  "নিকলী",
  "পাকুন্দিয়া",
  "তাড়াইল"
],
  "টাঙ্গাইল": [
  "টাঙ্গাইল সদর",
  "বাসাইল",
  "ভূঞাপুর",
  "দেলদুয়ার",
  "ধনবাড়ী",
  "ঘাটাইল",
  "গোপালপুর",
  "কালিহাতী",
  "মধুপুর",
  "মির্জাপুর",
  "নাগরপুর",
  "সখীপুর",
  "মধুপুর"
],
},
                      
"রাজশাহী": {
  "রাজশাহী": [
  "রাজশাহী সদর",
  "বাগমারা",
  "বাঘা",
  "চারঘাট",
  "দুর্গাপুর",
  "গোদাগাড়ী",
  "মোহনপুর",
  "পবা",
  "পুঠিয়া",
  "তানোর"
],
  "নাটোর": [
  "নাটোর সদর",
  "বাগাতিপাড়া",
  "বড়াইগ্রাম",
  "গুরুদাসপুর",
  "লালপুর",
  "নলডাঙ্গা",
  "সিংড়া"
],
  "নওগাঁ": [
  "নওগাঁ সদর",
  "আত্রাই",
  "বদলগাছী",
  "ধামইরহাট",
  "মান্দা",
  "মহাদেবপুর",
  "নিয়ামতপুর",
  "পত্নীতলা",
  "পোরশা",
  "রাণীনগর",
  "সাপাহার"
],
  "চাঁপাইনবাবগঞ্জ": [
  "চাঁপাইনবাবগঞ্জ সদর",
  "গোমস্তাপুর",
  "নাচোল",
  "শিবগঞ্জ",
  "ভোলাহাট"
],
  "পাবনা": [
  "পাবনা সদর",
  "আটঘরিয়া",
  "বেড়া",
  "ভাঙ্গুড়া",
  "চাটমোহর",
  "ফরিদপুর",
  "ঈশ্বরদী",
  "সাঁথিয়া",
  "সুজানগর"
],
  "সিরাজগঞ্জ": [
  "সিরাজগঞ্জ সদর",
  "বেলকুচি",
  "চৌহালী",
  "কামারখন্দ",
  "কাজীপুর",
  "রায়গঞ্জ",
  "শাহজাদপুর",
  "তাড়াশ",
  "উল্লাপাড়া"
],
  "বগুড়া": [
  "বগুড়া সদর",
  "আদমদিঘী",
  "ধুনট",
  "দুপচাঁচিয়া",
  "গাবতলী",
  "কাহালু",
  "নন্দীগ্রাম",
  "সারিয়াকান্দি",
  "শাজাহানপুর",
  "শেরপুর",
  "শিবগঞ্জ",
  "সোনাতলা"
],
  "জয়পুরহাট": [
  "জয়পুরহাট সদর",
  "আক্কেলপুর",
  "কালাই",
  "ক্ষেতলাল",
  "পাঁচবিবি"
],
},

"খুলনা": [
  "খুলনা সদর",
  "বটিয়াঘাটা",
  "দাকোপ",
  "দিঘলিয়া",
  "ডুমুরিয়া",
  "কয়রা",
  "পাইকগাছা",
  "ফুলতলা",
  "রূপসা",
  "তেরখাদা"
],
  "বাগেরহাট": [
  "বাগেরহাট সদর",
  "চিতলমারী",
  "ফকিরহাট",
  "কচুয়া",
  "মোল্লাহাট",
  "মোংলা",
  "মোড়েলগঞ্জ",
  "রামপাল",
  "শরণখোলা"
],
  "সাতক্ষীরা": [
  "সাতক্ষীরা সদর",
  "আশাশুনি",
  "দেবহাটা",
  "কলারোয়া",
  "কালীগঞ্জ",
  "শ্যামনগর",
  "তালা"
],
  "যশোর": [],
  "ঝিনাইদহ": [],
  "মাগুরা": [],
  "নড়াইল": [],
  "কুষ্টিয়া": [],
  "চুয়াডাঙ্গা": [],
  "মেহেরপুর": []
},
                      
"বরিশাল": {
  "বরিশাল": [],
  "ভোলা": [],
  "পটুয়াখালী": [],
  "পিরোজপুর": [],
  "ঝালকাঠি": [],
  "বরগুনা": []
},

"সিলেট": {
  "সিলেট": [],
  "মৌলভীবাজার": [],
  "হবিগঞ্জ": [],
  "সুনামগঞ্জ": []
},
                      
"রংপুর": {
  "রংপুর": [],
  "দিনাজপুর": [],
  "ঠাকুরগাঁও": [],
  "পঞ্চগড়": [],
  "নীলফামারী": [],
  "লালমনিরহাট": [],
  "কুড়িগ্রাম": [],
  "গাইবান্ধা": []
},

"ময়মনসিংহ": {
  "ময়মনসিংহ": [],
  "জামালপুর": [],
  "শেরপুর": [],
  "নেত্রকোনা": []
}
                      
};
const divisionSelect = document.getElementById("division");
const districtSelect = document.getElementById("district");
const upazilaSelect = document.getElementById("upazila");

// Division Load
for (const division in locationData) {
    const option = document.createElement("option");
    option.value = division;
    option.textContent = division;
    divisionSelect.appendChild(option);
}
// District Load
divisionSelect.addEventListener("change", function () {

    districtSelect.innerHTML = '<option value="">জেলা নির্বাচন করুন</option>';
    upazilaSelect.innerHTML = '<option value="">উপজেলা / থানা নির্বাচন করুন</option>';

    const selectedDivision = this.value;

    if (selectedDivision && locationData[selectedDivision]) {

        for (const district in locationData[selectedDivision]) {

            const option = document.createElement("option");
            option.value = district;
            option.textContent = district;

            districtSelect.appendChild(option);
        }
    }

});
  // Upazila Load
districtSelect.addEventListener("change", function () {

    upazilaSelect.innerHTML = '<option value="">উপজেলা / থানা নির্বাচন করুন</option>';

    const selectedDivision = divisionSelect.value;
    const selectedDistrict = this.value;

    if (
        selectedDivision &&
        selectedDistrict &&
        locationData[selectedDivision][selectedDistrict]
    ) {

        locationData[selectedDivision][selectedDistrict].forEach(function(upazila) {

            const option = document.createElement("option");
            option.value = upazila;
            option.textContent = upazila;

            upazilaSelect.appendChild(option);

        });

    }

});
